
&НаСервере
Процедура РасшЕГАИС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Группа = Элементы.Добавить(
	//	"РасшЕГАИС_ГруппаДополнительныеПераметры",
	//	Тип("ГруппаФормы"),
	//	ЭтаФорма);
	//	
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//
	//Группа.Заголовок = "Параметры помошника ЕГАИС:";
	//ПолеФлажка = Элементы.Добавить("Создавать списание по данным торгового зала", Тип("ПолеФормы"), Группа);
	//ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
	//ПолеФлажка.ПутьКДанным = "НаборКонстант.РасшЕГАИС_СоздаватьСписаниеПоДаннымТорговогоЗала";
	//ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизита");
КонецПроцедуры
