&НаСервере
Процедура РасшЕГАИС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ФормаСоздатьПереносНаР2.Видимость = Объект.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1;
	Элементы.ФормаСоздатьСписаниеПродаж.Видимость = Объект.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре2;

КонецПроцедуры

&НаКлиенте
Процедура РасшЕГАИС_ВидДокументаПриИзмененииПосле(Элемент)
	Элементы.ФормаСоздатьПереносНаР2.Видимость 		= Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1");
	Элементы.ФормаСоздатьСписаниеПродаж.Видимость 	= Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре2");
КонецПроцедуры


#Область СозданиеПереносаНаР2

&НаСервере
Процедура РасшЕГАИС_СоздатьПереносНаР2НаСервере()	
	Документы.ОстаткиЕГАИС.СоздатьПереносНаРегистр2(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура РасшЕГАИС_СоздатьПереносНаР2После(Команда)
	РасшЕГАИС_СоздатьПереносНаР2НаСервере();
КонецПроцедуры

&НаСервере
Процедура РасшЕГАИС_СоздатьСписаниеПродажПослеНаСервере()
	Документы.ОстаткиЕГАИС.СоздатьСписаниеПродаж(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура РасшЕГАИС_СоздатьСписаниеПродажПосле(Команда)
	РасшЕГАИС_СоздатьСписаниеПродажПослеНаСервере();
КонецПроцедуры

#КонецОбласти

